Tekla.Structures.Drawing.CurvedDimensionSetOrthogonal
The CurvedDimensionSetOrthogonal class defines a curved dimension set with orthogonal reference lines.

Tekla.Structures.Drawing.CurvedDimensionSetOrthogonal.Attributes
The curved dimension set orthogonal attributes.

Tekla.Structures.Drawing.CurvedDimensionSetOrthogonal.QueryOperation(Tekla.Structures.DrawingInternal.QueryTypeEnum)
Communicates with Tekla Structures core.
OperationType: The type of the executed operation.
Returns: True on success.

Tekla.Structures.Drawing.CurvedDimensionSetOrthogonal.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.